Revit 2024 API
IFCExternalServiceUIData.Document Property
 return the document
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Document Document { get; }
Visual Basic
Public ReadOnly Property Document As Document
	Get
Visual C++
public:
property Document^ Document {
	Document^ get ();
}
See Also
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace